grevaillot/svd_tools/headers/STM32H753x/fdcan2.h
#define FDCAN2_FDCAN_ECR_TEC_SHIFT		0
#define FDCAN2_FDCAN_ECR_TEC_MASK		0xff
/** @defgroup fdcan2_fdcan_ecr_tec TEC Transmit Error Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_psr FDCANPSR FDCAN Protocol Status Register
@{*/


#define FDCAN2_FDCAN_PSR_TDCV_SHIFT		16
#define FDCAN2_FDCAN_PSR_TDCV_MASK		0x7f
/** @defgroup fdcan2_fdcan_psr_tdcv TDCV Transmitter Delay Compensation Value
@{*/
/**@}*/

/** FDCAN2_FDCAN_PSR_PXE Protocol Exception Event **/
#define FDCAN2_FDCAN_PSR_PXE		(1 << 14)
/** FDCAN2_FDCAN_PSR_REDL Received FDCAN Message **/
#define FDCAN2_FDCAN_PSR_REDL		(1 << 13)
/** FDCAN2_FDCAN_PSR_RBRS BRS flag of last received FDCAN Message **/
#define FDCAN2_FDCAN_PSR_RBRS		(1 << 12)
/** FDCAN2_FDCAN_PSR_RESI ESI flag of last received FDCAN Message **/
#define FDCAN2_FDCAN_PSR_RESI		(1 << 11)

#define FDCAN2_FDCAN_PSR_DLEC_SHIFT		8
#define FDCAN2_FDCAN_PSR_DLEC_MASK		0x07
/** @defgroup fdcan2_fdcan_psr_dlec DLEC Data Last Error Code
@{*/
/**@}*/

/** FDCAN2_FDCAN_PSR_BO Bus_Off Status **/
#define FDCAN2_FDCAN_PSR_BO		(1 << 7)
/** FDCAN2_FDCAN_PSR_EW Warning Status **/
#define FDCAN2_FDCAN_PSR_EW		(1 << 6)
/** FDCAN2_FDCAN_PSR_EP Error Passive **/
#define FDCAN2_FDCAN_PSR_EP		(1 << 5)

#define FDCAN2_FDCAN_PSR_ACT_SHIFT		3
#define FDCAN2_FDCAN_PSR_ACT_MASK		0x03
/** @defgroup fdcan2_fdcan_psr_act ACT Activity
@{*/
/**@}*/


#define FDCAN2_FDCAN_PSR_LEC_SHIFT		0
#define FDCAN2_FDCAN_PSR_LEC_MASK		0x07
/** @defgroup fdcan2_fdcan_psr_lec LEC Last Error Code
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_tdcr FDCANTDCR FDCAN Transmitter Delay Compensation Register
@{*/


#define FDCAN2_FDCAN_TDCR_TDCO_SHIFT		8
#define FDCAN2_FDCAN_TDCR_TDCO_MASK		0x7f
/** @defgroup fdcan2_fdcan_tdcr_tdco TDCO Transmitter Delay Compensation Offset
@{*/
/**@}*/


#define FDCAN2_FDCAN_TDCR_TDCF_SHIFT		0
#define FDCAN2_FDCAN_TDCR_TDCF_MASK		0x7f
/** @defgroup fdcan2_fdcan_tdcr_tdcf TDCF Transmitter Delay Compensation Filter Window Length
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ir FDCANIR FDCAN Interrupt Register
@{*/

/** FDCAN2_FDCAN_IR_ARA Access to Reserved Address **/
#define FDCAN2_FDCAN_IR_ARA		(1 << 29)
/** FDCAN2_FDCAN_IR_PED Protocol Error in Data Phase (Data Bit Time is used) **/
#define FDCAN2_FDCAN_IR_PED		(1 << 28)
/** FDCAN2_FDCAN_IR_PEA Protocol Error in Arbitration Phase (Nominal Bit Time is used) **/
#define FDCAN2_FDCAN_IR_PEA		(1 << 27)
/** FDCAN2_FDCAN_IR_WDI Watchdog Interrupt **/
#define FDCAN2_FDCAN_IR_WDI		(1 << 26)
/** FDCAN2_FDCAN_IR_BO Bus_Off Status **/
#define FDCAN2_FDCAN_IR_BO		(1 << 25)
/** FDCAN2_FDCAN_IR_EW Warning Status **/
#define FDCAN2_FDCAN_IR_EW		(1 << 24)
/** FDCAN2_FDCAN_IR_EP Error Passive **/
#define FDCAN2_FDCAN_IR_EP		(1 << 23)
/** FDCAN2_FDCAN_IR_ELO Error Logging Overflow **/
#define FDCAN2_FDCAN_IR_ELO		(1 << 22)
/** FDCAN2_FDCAN_IR_DRX Message stored to Dedicated Rx Buffer **/
#define FDCAN2_FDCAN_IR_DRX		(1 << 19)
/** FDCAN2_FDCAN_IR_TOO Timeout Occurred **/
#define FDCAN2_FDCAN_IR_TOO		(1 << 18)
/** FDCAN2_FDCAN_IR_MRAF Message RAM Access Failure **/
#define FDCAN2_FDCAN_IR_MRAF		(1 << 17)
/** FDCAN2_FDCAN_IR_TSW Timestamp Wraparound **/
#define FDCAN2_FDCAN_IR_TSW		(1 << 16)
/** FDCAN2_FDCAN_IR_TEFL Tx Event FIFO Element Lost **/
#define FDCAN2_FDCAN_IR_TEFL		(1 << 15)
/** FDCAN2_FDCAN_IR_TEFF Tx Event FIFO Full **/
#define FDCAN2_FDCAN_IR_TEFF		(1 << 14)
/** FDCAN2_FDCAN_IR_TEFW Tx Event FIFO Watermark Reached **/
#define FDCAN2_FDCAN_IR_TEFW		(1 << 13)
/** FDCAN2_FDCAN_IR_TEFN Tx Event FIFO New Entry **/
#define FDCAN2_FDCAN_IR_TEFN		(1 << 12)
/** FDCAN2_FDCAN_IR_TEF Tx FIFO Empty **/
#define FDCAN2_FDCAN_IR_TEF		(1 << 11)
/** FDCAN2_FDCAN_IR_TCF Transmission Cancellation Finished **/
#define FDCAN2_FDCAN_IR_TCF		(1 << 10)
/** FDCAN2_FDCAN_IR_TC Transmission Completed **/
#define FDCAN2_FDCAN_IR_TC		(1 << 9)
/** FDCAN2_FDCAN_IR_HPM High Priority Message **/
#define FDCAN2_FDCAN_IR_HPM		(1 << 8)
/** FDCAN2_FDCAN_IR_RF1L Rx FIFO 1 Message Lost **/
#define FDCAN2_FDCAN_IR_RF1L		(1 << 7)
/** FDCAN2_FDCAN_IR_RF1F Rx FIFO 1 Watermark Reached **/
#define FDCAN2_FDCAN_IR_RF1F		(1 << 6)
/** FDCAN2_FDCAN_IR_RF1W Rx FIFO 1 Watermark Reached **/
#define FDCAN2_FDCAN_IR_RF1W		(1 << 5)
/** FDCAN2_FDCAN_IR_RF1N Rx FIFO 1 New Message **/
#define FDCAN2_FDCAN_IR_RF1N		(1 << 4)
/** FDCAN2_FDCAN_IR_RF0L Rx FIFO 0 Message Lost **/
#define FDCAN2_FDCAN_IR_RF0L		(1 << 3)
/** FDCAN2_FDCAN_IR_RF0F Rx FIFO 0 Full **/
#define FDCAN2_FDCAN_IR_RF0F		(1 << 2)
/** FDCAN2_FDCAN_IR_RF0W Rx FIFO 0 Full **/
#define FDCAN2_FDCAN_IR_RF0W		(1 << 1)
/** FDCAN2_FDCAN_IR_RF0N Rx FIFO 0 New Message **/
#define FDCAN2_FDCAN_IR_RF0N		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_ie FDCANIE FDCAN Interrupt Enable Register
@{*/

/** FDCAN2_FDCAN_IE_ARAE Access to Reserved Address Enable **/
#define FDCAN2_FDCAN_IE_ARAE		(1 << 29)
/** FDCAN2_FDCAN_IE_PEDE Protocol Error in Data Phase Enable **/
#define FDCAN2_FDCAN_IE_PEDE		(1 << 28)
/** FDCAN2_FDCAN_IE_PEAE Protocol Error in Arbitration Phase Enable **/
#define FDCAN2_FDCAN_IE_PEAE		(1 << 27)
/** FDCAN2_FDCAN_IE_WDIE Watchdog Interrupt Enable **/
#define FDCAN2_FDCAN_IE_WDIE		(1 << 26)
/** FDCAN2_FDCAN_IE_BOE Bus_Off Status Enable **/
#define FDCAN2_FDCAN_IE_BOE		(1 << 25)
/** FDCAN2_FDCAN_IE_EWE Warning Status Enable **/
#define FDCAN2_FDCAN_IE_EWE		(1 << 24)
/** FDCAN2_FDCAN_IE_EPE Error Passive Enable **/
#define FDCAN2_FDCAN_IE_EPE		(1 << 23)
/** FDCAN2_FDCAN_IE_ELOE Error Logging Overflow Enable **/
#define FDCAN2_FDCAN_IE_ELOE		(1 << 22)
/** FDCAN2_FDCAN_IE_BEUE Bit Error Uncorrected Interrupt Enable **/
#define FDCAN2_FDCAN_IE_BEUE		(1 << 21)
/** FDCAN2_FDCAN_IE_BECE Bit Error Corrected Interrupt Enable **/
#define FDCAN2_FDCAN_IE_BECE		(1 << 20)
/** FDCAN2_FDCAN_IE_DRXE Message stored to Dedicated Rx Buffer Enable **/
#define FDCAN2_FDCAN_IE_DRXE		(1 << 19)
/** FDCAN2_FDCAN_IE_TOOE Timeout Occurred Enable **/
#define FDCAN2_FDCAN_IE_TOOE		(1 << 18)
/** FDCAN2_FDCAN_IE_MRAFE Message RAM Access Failure Enable **/
#define FDCAN2_FDCAN_IE_MRAFE		(1 << 17)
/** FDCAN2_FDCAN_IE_TSWE Timestamp Wraparound Enable **/
#define FDCAN2_FDCAN_IE_TSWE		(1 << 16)
/** FDCAN2_FDCAN_IE_TEFLE Tx Event FIFO Element Lost Enable **/
#define FDCAN2_FDCAN_IE_TEFLE		(1 << 15)
/** FDCAN2_FDCAN_IE_TEFFE Tx Event FIFO Full Enable **/
#define FDCAN2_FDCAN_IE_TEFFE		(1 << 14)
/** FDCAN2_FDCAN_IE_TEFWE Tx Event FIFO Watermark Reached Enable **/
#define FDCAN2_FDCAN_IE_TEFWE		(1 << 13)
/** FDCAN2_FDCAN_IE_TEFNE Tx Event FIFO New Entry Enable **/
#define FDCAN2_FDCAN_IE_TEFNE		(1 << 12)
/** FDCAN2_FDCAN_IE_TEFE Tx FIFO Empty Enable **/
#define FDCAN2_FDCAN_IE_TEFE		(1 << 11)
/** FDCAN2_FDCAN_IE_TCFE Transmission Cancellation Finished Enable **/
#define FDCAN2_FDCAN_IE_TCFE		(1 << 10)
/** FDCAN2_FDCAN_IE_TCE Transmission Completed Enable **/
#define FDCAN2_FDCAN_IE_TCE		(1 << 9)
/** FDCAN2_FDCAN_IE_HPME High Priority Message Enable **/
#define FDCAN2_FDCAN_IE_HPME		(1 << 8)
/** FDCAN2_FDCAN_IE_RF1LE Rx FIFO 1 Message Lost Enable **/
#define FDCAN2_FDCAN_IE_RF1LE		(1 << 7)
/** FDCAN2_FDCAN_IE_RF1FE Rx FIFO 1 Watermark Reached Enable **/
#define FDCAN2_FDCAN_IE_RF1FE		(1 << 6)
/** FDCAN2_FDCAN_IE_RF1WE Rx FIFO 1 Watermark Reached Enable **/
#define FDCAN2_FDCAN_IE_RF1WE		(1 << 5)
/** FDCAN2_FDCAN_IE_RF1NE Rx FIFO 1 New Message Enable **/
#define FDCAN2_FDCAN_IE_RF1NE		(1 << 4)
/** FDCAN2_FDCAN_IE_RF0LE Rx FIFO 0 Message Lost Enable **/
#define FDCAN2_FDCAN_IE_RF0LE		(1 << 3)
/** FDCAN2_FDCAN_IE_RF0FE Rx FIFO 0 Full Enable **/
#define FDCAN2_FDCAN_IE_RF0FE		(1 << 2)
/** FDCAN2_FDCAN_IE_RF0WE Rx FIFO 0 Full Enable **/
#define FDCAN2_FDCAN_IE_RF0WE		(1 << 1)
/** FDCAN2_FDCAN_IE_RF0NE Rx FIFO 0 New Message Enable **/
#define FDCAN2_FDCAN_IE_RF0NE		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_ils FDCANILS FDCAN Interrupt Line Select Register
@{*/

