grevaillot/svd_tools/headers/STM32H753x/fdcan2.h
/** FDCAN2_FDCAN_ILS_ARAL Access to Reserved Address Line **/
#define FDCAN2_FDCAN_ILS_ARAL		(1 << 29)
/** FDCAN2_FDCAN_ILS_PEDL Protocol Error in Data Phase Line **/
#define FDCAN2_FDCAN_ILS_PEDL		(1 << 28)
/** FDCAN2_FDCAN_ILS_PEAL Protocol Error in Arbitration Phase Line **/
#define FDCAN2_FDCAN_ILS_PEAL		(1 << 27)
/** FDCAN2_FDCAN_ILS_WDIL Watchdog Interrupt Line **/
#define FDCAN2_FDCAN_ILS_WDIL		(1 << 26)
/** FDCAN2_FDCAN_ILS_BOL Bus_Off Status **/
#define FDCAN2_FDCAN_ILS_BOL		(1 << 25)
/** FDCAN2_FDCAN_ILS_EWL Warning Status Interrupt Line **/
#define FDCAN2_FDCAN_ILS_EWL		(1 << 24)
/** FDCAN2_FDCAN_ILS_EPL Error Passive Interrupt Line **/
#define FDCAN2_FDCAN_ILS_EPL		(1 << 23)
/** FDCAN2_FDCAN_ILS_ELOL Error Logging Overflow Interrupt Line **/
#define FDCAN2_FDCAN_ILS_ELOL		(1 << 22)
/** FDCAN2_FDCAN_ILS_BEUL Bit Error Uncorrected Interrupt Line **/
#define FDCAN2_FDCAN_ILS_BEUL		(1 << 21)
/** FDCAN2_FDCAN_ILS_BECL Bit Error Corrected Interrupt Line **/
#define FDCAN2_FDCAN_ILS_BECL		(1 << 20)
/** FDCAN2_FDCAN_ILS_DRXL Message stored to Dedicated Rx Buffer Interrupt Line **/
#define FDCAN2_FDCAN_ILS_DRXL		(1 << 19)
/** FDCAN2_FDCAN_ILS_TOOL Timeout Occurred Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TOOL		(1 << 18)
/** FDCAN2_FDCAN_ILS_MRAFL Message RAM Access Failure Interrupt Line **/
#define FDCAN2_FDCAN_ILS_MRAFL		(1 << 17)
/** FDCAN2_FDCAN_ILS_TSWL Timestamp Wraparound Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TSWL		(1 << 16)
/** FDCAN2_FDCAN_ILS_TEFLL Tx Event FIFO Element Lost Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TEFLL		(1 << 15)
/** FDCAN2_FDCAN_ILS_TEFFL Tx Event FIFO Full Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TEFFL		(1 << 14)
/** FDCAN2_FDCAN_ILS_TEFWL Tx Event FIFO Watermark Reached Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TEFWL		(1 << 13)
/** FDCAN2_FDCAN_ILS_TEFNL Tx Event FIFO New Entry Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TEFNL		(1 << 12)
/** FDCAN2_FDCAN_ILS_TEFL Tx FIFO Empty Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TEFL		(1 << 11)
/** FDCAN2_FDCAN_ILS_TCFL Transmission Cancellation Finished Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TCFL		(1 << 10)
/** FDCAN2_FDCAN_ILS_TCL Transmission Completed Interrupt Line **/
#define FDCAN2_FDCAN_ILS_TCL		(1 << 9)
/** FDCAN2_FDCAN_ILS_HPML High Priority Message Interrupt Line **/
#define FDCAN2_FDCAN_ILS_HPML		(1 << 8)
/** FDCAN2_FDCAN_ILS_RF1LL Rx FIFO 1 Message Lost Interrupt Line **/
#define FDCAN2_FDCAN_ILS_RF1LL		(1 << 7)
/** FDCAN2_FDCAN_ILS_RF1FL Rx FIFO 1 Full Interrupt Line **/
#define FDCAN2_FDCAN_ILS_RF1FL		(1 << 6)
/** FDCAN2_FDCAN_ILS_RF1WL Rx FIFO 1 Watermark Reached Interrupt Line **/
#define FDCAN2_FDCAN_ILS_RF1WL		(1 << 5)
/** FDCAN2_FDCAN_ILS_RF1NL Rx FIFO 1 New Message Interrupt Line **/
#define FDCAN2_FDCAN_ILS_RF1NL		(1 << 4)
/** FDCAN2_FDCAN_ILS_RF0LL Rx FIFO 0 Message Lost Interrupt Line **/
#define FDCAN2_FDCAN_ILS_RF0LL		(1 << 3)
/** FDCAN2_FDCAN_ILS_RF0FL Rx FIFO 0 Full Interrupt Line **/
#define FDCAN2_FDCAN_ILS_RF0FL		(1 << 2)
/** FDCAN2_FDCAN_ILS_RF0WL Rx FIFO 0 Watermark Reached Interrupt Line **/
#define FDCAN2_FDCAN_ILS_RF0WL		(1 << 1)
/** FDCAN2_FDCAN_ILS_RF0NL Rx FIFO 0 New Message Interrupt Line **/
#define FDCAN2_FDCAN_ILS_RF0NL		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_ile FDCANILE FDCAN Interrupt Line Enable Register
@{*/

/** FDCAN2_FDCAN_ILE_EINT1 Enable Interrupt Line 1 **/
#define FDCAN2_FDCAN_ILE_EINT1		(1 << 1)
/** FDCAN2_FDCAN_ILE_EINT0 Enable Interrupt Line 0 **/
#define FDCAN2_FDCAN_ILE_EINT0		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_gfc FDCANGFC FDCAN Global Filter Configuration Register
@{*/


#define FDCAN2_FDCAN_GFC_ANFS_SHIFT		4
#define FDCAN2_FDCAN_GFC_ANFS_MASK		0x03
/** @defgroup fdcan2_fdcan_gfc_anfs ANFS Accept Non-matching Frames Standard
@{*/
/**@}*/


#define FDCAN2_FDCAN_GFC_ANFE_SHIFT		2
#define FDCAN2_FDCAN_GFC_ANFE_MASK		0x03
/** @defgroup fdcan2_fdcan_gfc_anfe ANFE Accept Non-matching Frames Extended
@{*/
/**@}*/

/** FDCAN2_FDCAN_GFC_RRFS Reject Remote Frames Standard **/
#define FDCAN2_FDCAN_GFC_RRFS		(1 << 1)
/** FDCAN2_FDCAN_GFC_RRFE Reject Remote Frames Extended **/
#define FDCAN2_FDCAN_GFC_RRFE		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_sidfc FDCANSIDFC FDCAN Standard ID Filter Configuration Register
@{*/


#define FDCAN2_FDCAN_SIDFC_LSS_SHIFT		16
#define FDCAN2_FDCAN_SIDFC_LSS_MASK		0xff
/** @defgroup fdcan2_fdcan_sidfc_lss LSS List Size Standard
@{*/
/**@}*/


#define FDCAN2_FDCAN_SIDFC_FLSSA_SHIFT		2
#define FDCAN2_FDCAN_SIDFC_FLSSA_MASK		0x3fff
/** @defgroup fdcan2_fdcan_sidfc_flssa FLSSA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_xidfc FDCANXIDFC FDCAN Extended ID Filter Configuration Register
@{*/


#define FDCAN2_FDCAN_XIDFC_LSE_SHIFT		16
#define FDCAN2_FDCAN_XIDFC_LSE_MASK		0xff
/** @defgroup fdcan2_fdcan_xidfc_lse LSE List Size Extended
@{*/
/**@}*/


#define FDCAN2_FDCAN_XIDFC_FLESA_SHIFT		2
#define FDCAN2_FDCAN_XIDFC_FLESA_MASK		0x3fff
/** @defgroup fdcan2_fdcan_xidfc_flesa FLESA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_xidam FDCANXIDAM FDCAN Extended ID and Mask Register
@{*/


#define FDCAN2_FDCAN_XIDAM_EIDM_SHIFT		0
#define FDCAN2_FDCAN_XIDAM_EIDM_MASK		0x1fffffff
/** @defgroup fdcan2_fdcan_xidam_eidm EIDM Extended ID Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_hpms FDCANHPMS FDCAN High Priority Message Status Register
@{*/

/** FDCAN2_FDCAN_HPMS_FLST Filter List **/
#define FDCAN2_FDCAN_HPMS_FLST		(1 << 15)

#define FDCAN2_FDCAN_HPMS_FIDX_SHIFT		8
#define FDCAN2_FDCAN_HPMS_FIDX_MASK		0x7f
/** @defgroup fdcan2_fdcan_hpms_fidx FIDX Filter Index
@{*/
/**@}*/


#define FDCAN2_FDCAN_HPMS_MSI_SHIFT		6
#define FDCAN2_FDCAN_HPMS_MSI_MASK		0x03
/** @defgroup fdcan2_fdcan_hpms_msi MSI Message Storage Indicator
@{*/
/**@}*/


#define FDCAN2_FDCAN_HPMS_BIDX_SHIFT		0
#define FDCAN2_FDCAN_HPMS_BIDX_MASK		0x3f
/** @defgroup fdcan2_fdcan_hpms_bidx BIDX Buffer Index
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_ndat1 FDCANNDAT1 FDCAN New Data 1 Register
@{*/

/** FDCAN2_FDCAN_NDAT1_ND31 New data **/
#define FDCAN2_FDCAN_NDAT1_ND31		(1 << 31)
/** FDCAN2_FDCAN_NDAT1_ND30 New data **/
#define FDCAN2_FDCAN_NDAT1_ND30		(1 << 30)
/** FDCAN2_FDCAN_NDAT1_ND29 New data **/
#define FDCAN2_FDCAN_NDAT1_ND29		(1 << 29)
/** FDCAN2_FDCAN_NDAT1_ND28 New data **/
#define FDCAN2_FDCAN_NDAT1_ND28		(1 << 28)
/** FDCAN2_FDCAN_NDAT1_ND27 New data **/
#define FDCAN2_FDCAN_NDAT1_ND27		(1 << 27)
/** FDCAN2_FDCAN_NDAT1_ND26 New data **/
#define FDCAN2_FDCAN_NDAT1_ND26		(1 << 26)
/** FDCAN2_FDCAN_NDAT1_ND25 New data **/
#define FDCAN2_FDCAN_NDAT1_ND25		(1 << 25)
/** FDCAN2_FDCAN_NDAT1_ND24 New data **/
#define FDCAN2_FDCAN_NDAT1_ND24		(1 << 24)
/** FDCAN2_FDCAN_NDAT1_ND23 New data **/
#define FDCAN2_FDCAN_NDAT1_ND23		(1 << 23)
/** FDCAN2_FDCAN_NDAT1_ND22 New data **/
#define FDCAN2_FDCAN_NDAT1_ND22		(1 << 22)
/** FDCAN2_FDCAN_NDAT1_ND21 New data **/
#define FDCAN2_FDCAN_NDAT1_ND21		(1 << 21)
/** FDCAN2_FDCAN_NDAT1_ND20 New data **/
#define FDCAN2_FDCAN_NDAT1_ND20		(1 << 20)
/** FDCAN2_FDCAN_NDAT1_ND19 New data **/
#define FDCAN2_FDCAN_NDAT1_ND19		(1 << 19)
/** FDCAN2_FDCAN_NDAT1_ND18 New data **/
#define FDCAN2_FDCAN_NDAT1_ND18		(1 << 18)
/** FDCAN2_FDCAN_NDAT1_ND17 New data **/
#define FDCAN2_FDCAN_NDAT1_ND17		(1 << 17)
/** FDCAN2_FDCAN_NDAT1_ND16 New data **/
#define FDCAN2_FDCAN_NDAT1_ND16		(1 << 16)
/** FDCAN2_FDCAN_NDAT1_ND15 New data **/
#define FDCAN2_FDCAN_NDAT1_ND15		(1 << 15)
/** FDCAN2_FDCAN_NDAT1_ND14 New data **/
#define FDCAN2_FDCAN_NDAT1_ND14		(1 << 14)
/** FDCAN2_FDCAN_NDAT1_ND13 New data **/
#define FDCAN2_FDCAN_NDAT1_ND13		(1 << 13)
/** FDCAN2_FDCAN_NDAT1_ND12 New data **/
#define FDCAN2_FDCAN_NDAT1_ND12		(1 << 12)
/** FDCAN2_FDCAN_NDAT1_ND11 New data **/
#define FDCAN2_FDCAN_NDAT1_ND11		(1 << 11)
/** FDCAN2_FDCAN_NDAT1_ND10 New data **/
#define FDCAN2_FDCAN_NDAT1_ND10		(1 << 10)
/** FDCAN2_FDCAN_NDAT1_ND9 New data **/
#define FDCAN2_FDCAN_NDAT1_ND9		(1 << 9)
/** FDCAN2_FDCAN_NDAT1_ND8 New data **/
#define FDCAN2_FDCAN_NDAT1_ND8		(1 << 8)
/** FDCAN2_FDCAN_NDAT1_ND7 New data **/
#define FDCAN2_FDCAN_NDAT1_ND7		(1 << 7)
/** FDCAN2_FDCAN_NDAT1_ND6 New data **/
#define FDCAN2_FDCAN_NDAT1_ND6		(1 << 6)
/** FDCAN2_FDCAN_NDAT1_ND5 New data **/
#define FDCAN2_FDCAN_NDAT1_ND5		(1 << 5)
/** FDCAN2_FDCAN_NDAT1_ND4 New data **/
#define FDCAN2_FDCAN_NDAT1_ND4		(1 << 4)
/** FDCAN2_FDCAN_NDAT1_ND3 New data **/
#define FDCAN2_FDCAN_NDAT1_ND3		(1 << 3)
/** FDCAN2_FDCAN_NDAT1_ND2 New data **/
#define FDCAN2_FDCAN_NDAT1_ND2		(1 << 2)
/** FDCAN2_FDCAN_NDAT1_ND1 New data **/
#define FDCAN2_FDCAN_NDAT1_ND1		(1 << 1)
/** FDCAN2_FDCAN_NDAT1_ND0 New data **/
#define FDCAN2_FDCAN_NDAT1_ND0		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_ndat2 FDCANNDAT2 FDCAN New Data 2 Register
@{*/

