grevaillot/svd_tools/headers/STM32H753x/fdcan2.h
/** FDCAN2_FDCAN_NDAT2_ND63 New data **/
#define FDCAN2_FDCAN_NDAT2_ND63		(1 << 31)
/** FDCAN2_FDCAN_NDAT2_ND62 New data **/
#define FDCAN2_FDCAN_NDAT2_ND62		(1 << 30)
/** FDCAN2_FDCAN_NDAT2_ND61 New data **/
#define FDCAN2_FDCAN_NDAT2_ND61		(1 << 29)
/** FDCAN2_FDCAN_NDAT2_ND60 New data **/
#define FDCAN2_FDCAN_NDAT2_ND60		(1 << 28)
/** FDCAN2_FDCAN_NDAT2_ND59 New data **/
#define FDCAN2_FDCAN_NDAT2_ND59		(1 << 27)
/** FDCAN2_FDCAN_NDAT2_ND58 New data **/
#define FDCAN2_FDCAN_NDAT2_ND58		(1 << 26)
/** FDCAN2_FDCAN_NDAT2_ND57 New data **/
#define FDCAN2_FDCAN_NDAT2_ND57		(1 << 25)
/** FDCAN2_FDCAN_NDAT2_ND56 New data **/
#define FDCAN2_FDCAN_NDAT2_ND56		(1 << 24)
/** FDCAN2_FDCAN_NDAT2_ND55 New data **/
#define FDCAN2_FDCAN_NDAT2_ND55		(1 << 23)
/** FDCAN2_FDCAN_NDAT2_ND54 New data **/
#define FDCAN2_FDCAN_NDAT2_ND54		(1 << 22)
/** FDCAN2_FDCAN_NDAT2_ND53 New data **/
#define FDCAN2_FDCAN_NDAT2_ND53		(1 << 21)
/** FDCAN2_FDCAN_NDAT2_ND52 New data **/
#define FDCAN2_FDCAN_NDAT2_ND52		(1 << 20)
/** FDCAN2_FDCAN_NDAT2_ND51 New data **/
#define FDCAN2_FDCAN_NDAT2_ND51		(1 << 19)
/** FDCAN2_FDCAN_NDAT2_ND50 New data **/
#define FDCAN2_FDCAN_NDAT2_ND50		(1 << 18)
/** FDCAN2_FDCAN_NDAT2_ND49 New data **/
#define FDCAN2_FDCAN_NDAT2_ND49		(1 << 17)
/** FDCAN2_FDCAN_NDAT2_ND48 New data **/
#define FDCAN2_FDCAN_NDAT2_ND48		(1 << 16)
/** FDCAN2_FDCAN_NDAT2_ND47 New data **/
#define FDCAN2_FDCAN_NDAT2_ND47		(1 << 15)
/** FDCAN2_FDCAN_NDAT2_ND46 New data **/
#define FDCAN2_FDCAN_NDAT2_ND46		(1 << 14)
/** FDCAN2_FDCAN_NDAT2_ND45 New data **/
#define FDCAN2_FDCAN_NDAT2_ND45		(1 << 13)
/** FDCAN2_FDCAN_NDAT2_ND44 New data **/
#define FDCAN2_FDCAN_NDAT2_ND44		(1 << 12)
/** FDCAN2_FDCAN_NDAT2_ND43 New data **/
#define FDCAN2_FDCAN_NDAT2_ND43		(1 << 11)
/** FDCAN2_FDCAN_NDAT2_ND42 New data **/
#define FDCAN2_FDCAN_NDAT2_ND42		(1 << 10)
/** FDCAN2_FDCAN_NDAT2_ND41 New data **/
#define FDCAN2_FDCAN_NDAT2_ND41		(1 << 9)
/** FDCAN2_FDCAN_NDAT2_ND40 New data **/
#define FDCAN2_FDCAN_NDAT2_ND40		(1 << 8)
/** FDCAN2_FDCAN_NDAT2_ND39 New data **/
#define FDCAN2_FDCAN_NDAT2_ND39		(1 << 7)
/** FDCAN2_FDCAN_NDAT2_ND38 New data **/
#define FDCAN2_FDCAN_NDAT2_ND38		(1 << 6)
/** FDCAN2_FDCAN_NDAT2_ND37 New data **/
#define FDCAN2_FDCAN_NDAT2_ND37		(1 << 5)
/** FDCAN2_FDCAN_NDAT2_ND36 New data **/
#define FDCAN2_FDCAN_NDAT2_ND36		(1 << 4)
/** FDCAN2_FDCAN_NDAT2_ND35 New data **/
#define FDCAN2_FDCAN_NDAT2_ND35		(1 << 3)
/** FDCAN2_FDCAN_NDAT2_ND34 New data **/
#define FDCAN2_FDCAN_NDAT2_ND34		(1 << 2)
/** FDCAN2_FDCAN_NDAT2_ND33 New data **/
#define FDCAN2_FDCAN_NDAT2_ND33		(1 << 1)
/** FDCAN2_FDCAN_NDAT2_ND32 New data **/
#define FDCAN2_FDCAN_NDAT2_ND32		(1 << 0)

/**@}*/

/** @defgroup fdcan2_fdcan_rxf0c FDCANRXF0C FDCAN Rx FIFO 0 Configuration Register
@{*/


#define FDCAN2_FDCAN_RXF0C_F0WM_SHIFT		24
#define FDCAN2_FDCAN_RXF0C_F0WM_MASK		0xff
/** @defgroup fdcan2_fdcan_rxf0c_f0wm F0WM FIFO 0 Watermark
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXF0C_F0S_SHIFT		16
#define FDCAN2_FDCAN_RXF0C_F0S_MASK		0xff
/** @defgroup fdcan2_fdcan_rxf0c_f0s F0S Rx FIFO 0 Size
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXF0C_F0SA_SHIFT		2
#define FDCAN2_FDCAN_RXF0C_F0SA_MASK		0x3fff
/** @defgroup fdcan2_fdcan_rxf0c_f0sa F0SA Rx FIFO 0 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_rxf0s FDCANRXF0S FDCAN Rx FIFO 0 Status Register
@{*/

/** FDCAN2_FDCAN_RXF0S_RF0L Rx FIFO 0 Message Lost **/
#define FDCAN2_FDCAN_RXF0S_RF0L		(1 << 25)
/** FDCAN2_FDCAN_RXF0S_F0F Rx FIFO 0 Full **/
#define FDCAN2_FDCAN_RXF0S_F0F		(1 << 24)

#define FDCAN2_FDCAN_RXF0S_F0P_SHIFT		16
#define FDCAN2_FDCAN_RXF0S_F0P_MASK		0x3f
/** @defgroup fdcan2_fdcan_rxf0s_f0p F0P Rx FIFO 0 Put Index
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXF0S_F0G_SHIFT		8
#define FDCAN2_FDCAN_RXF0S_F0G_MASK		0x3f
/** @defgroup fdcan2_fdcan_rxf0s_f0g F0G Rx FIFO 0 Get Index
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXF0S_F0FL_SHIFT		0
#define FDCAN2_FDCAN_RXF0S_F0FL_MASK		0x7f
/** @defgroup fdcan2_fdcan_rxf0s_f0fl F0FL Rx FIFO 0 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_rxf0a FDCANRXF0A CAN Rx FIFO 0 Acknowledge Register
@{*/


#define FDCAN2_FDCAN_RXF0A_FA01_SHIFT		0
#define FDCAN2_FDCAN_RXF0A_FA01_MASK		0x3f
/** @defgroup fdcan2_fdcan_rxf0a_fa01 FA01 Rx FIFO 0 Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_rxbc FDCANRXBC FDCAN Rx Buffer Configuration Register
@{*/


#define FDCAN2_FDCAN_RXBC_RBSA_SHIFT		2
#define FDCAN2_FDCAN_RXBC_RBSA_MASK		0x3fff
/** @defgroup fdcan2_fdcan_rxbc_rbsa RBSA Rx Buffer Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_rxf1c FDCANRXF1C FDCAN Rx FIFO 1 Configuration Register
@{*/


#define FDCAN2_FDCAN_RXF1C_F1WM_SHIFT		24
#define FDCAN2_FDCAN_RXF1C_F1WM_MASK		0x7f
/** @defgroup fdcan2_fdcan_rxf1c_f1wm F1WM Rx FIFO 1 Watermark
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXF1C_F1S_SHIFT		16
#define FDCAN2_FDCAN_RXF1C_F1S_MASK		0x7f
/** @defgroup fdcan2_fdcan_rxf1c_f1s F1S Rx FIFO 1 Size
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXF1C_F1SA_SHIFT		2
#define FDCAN2_FDCAN_RXF1C_F1SA_MASK		0x3fff
/** @defgroup fdcan2_fdcan_rxf1c_f1sa F1SA Rx FIFO 1 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_rxf1s FDCANRXF1S FDCAN Rx FIFO 1 Status Register
@{*/


#define FDCAN2_FDCAN_RXF1S_DMS_SHIFT		30
#define FDCAN2_FDCAN_RXF1S_DMS_MASK		0x03
/** @defgroup fdcan2_fdcan_rxf1s_dms DMS Debug Message Status
@{*/
/**@}*/

/** FDCAN2_FDCAN_RXF1S_RF1L Rx FIFO 1 Message Lost **/
#define FDCAN2_FDCAN_RXF1S_RF1L		(1 << 25)
/** FDCAN2_FDCAN_RXF1S_F1F Rx FIFO 1 Full **/
#define FDCAN2_FDCAN_RXF1S_F1F		(1 << 24)

#define FDCAN2_FDCAN_RXF1S_F1PI_SHIFT		16
#define FDCAN2_FDCAN_RXF1S_F1PI_MASK		0x7f
/** @defgroup fdcan2_fdcan_rxf1s_f1pi F1PI Rx FIFO 1 Put Index
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXF1S_F1GI_SHIFT		8
#define FDCAN2_FDCAN_RXF1S_F1GI_MASK		0x7f
/** @defgroup fdcan2_fdcan_rxf1s_f1gi F1GI Rx FIFO 1 Get Index
@{*/
/**@}*/


#define FDCAN2_FDCAN_RXF1S_F1FL_SHIFT		0
#define FDCAN2_FDCAN_RXF1S_F1FL_MASK		0x7f
/** @defgroup fdcan2_fdcan_rxf1s_f1fl F1FL Rx FIFO 1 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan2_fdcan_rxf1a FDCANRXF1A FDCAN Rx FIFO 1 Acknowledge Register
@{*/


#define FDCAN2_FDCAN_RXF1A_F1AI_SHIFT		0
#define FDCAN2_FDCAN_RXF1A_F1AI_MASK		0x3f
/** @defgroup fdcan2_fdcan_rxf1a_f1ai F1AI Rx FIFO 1 Acknowledge Index
@{*/
/**@}*/


/**@}*/

